app/views/exercicios/index.html.erb

    <td><%= exercicio.ativo %></td>
    <td><%= exercicio.membros.count  %></td>
---
SELECT "membros".* FROM "membros" WHERE "membros"."exercicio_id" = ?  [[nil, 1]]
SELECT COUNT(*) FROM "membros" WHERE "membros"."exercicio_id" = ?  [[nil, 3]]