app/views/musculos/_form.html.erb

			  <% Atividade.where(:tipo =>'M').each do |atividade| %>
				<%= check_box_tag "musculo[atividade_ids][]", atividade.id, @musculo.atividades.include?(atividade) %>
---
SELECT "atividades".* FROM "atividades"
SELECT 1 AS one FROM "atividades" INNER JOIN "exercicios" ON "atividades"."id" = "exercicios"."atividade_id" WHERE "exercicios"."musculo_id" = ? AND "atividades"."id" = 1 LIMIT 1  [["musculo_id", 2]]