app/views/musculos/show.html.erb

<p>
<% @musculo.atividades.each do |iAtividade| %>
---
SELECT "atividades".* FROM "atividades" INNER JOIN "exercicios" ON "atividades"."id" = "exercicios"."atividade_id" WHERE "exercicios"."musculo_id" = ?  [["musculo_id", 3]]