app/views/treinos/edit.html.erb

<div>
	<% Musculo.all.each do |iMusculo| %>
---
SELECT "musculos".* FROM "musculos"


		<%iMusculo.atividades.each do |iAtividade| %>
---
SELECT "atividades".* FROM "atividades" INNER JOIN "exercicios" ON "atividades"."id" = "exercicios"."atividade_id" WHERE "exercicios"."musculo_id" = ?  [["musculo_id", 4]]