app/views/treinos/show.html.erb

SELECT "atividades".* FROM "atividades" INNER JOIN "atividadetreinos" ON "atividades"."id" = "atividadetreinos"."atividade_id" WHERE "atividadetreinos"."treino_id" = ?  [["treino_id", 1]]
---
  <br>
	<% @treino.atividades.each do |iAtividade| %>

SELECT "musculos".* FROM "musculos" INNER JOIN "exercicios" ON "musculos"."id" = "exercicios"."musculo_id" WHERE "exercicios"."atividade_id" = ?  [["atividade_id", 1]]
---
    	<br>
    	<% iAtividade.musculos.each do |iMusculo| %>