app/views/alunos/_form.html.erb

SELECT "diasemanas".* FROM "diasemanas"
SELECT 1 AS one FROM "diasemanas" INNER JOIN "alunoaulas" ON "diasemanas"."id" = "alunoaulas"."diasemana_id" WHERE "alunoaulas"."aluno_id" = ? AND "diasemanas"."id" = 1 LIMIT 1  [["aluno_id", 8]]
---
	<div class="controls">
		<% Diasemana.all.each do |iDia| %>
			<%= check_box_tag 'aluno[diasemana_ids][]', iDia.id, @aluno.diasemanas.include?(iDia)  %>