app/views/alunos/index.html.erb

SELECT "alunos".* FROM "alunos" LIMIT 1 OFFSET 0
---

	g.column name:  'Cód.Aluno', attribute: 'idAcademia' do |aluno|