app/views/alunos/new.html.erb

SELECT "atividades".* FROM "atividades"
---

<% Atividade.all.each do |atividade| %>