app/views/alunos/new.html.erb


<% Musculo.all.each do |iMusculo| %>
---
SELECT "musculos".* FROM "musculos"