app/views/alunos/show.html.erb

SELECT "diasemanas".* FROM "diasemanas" INNER JOIN "alunoaulas" ON "diasemanas"."id" = "alunoaulas"."diasemana_id" WHERE "alunoaulas"."aluno_id" = ?  [["aluno_id", 9]]
---
  <strong>Dias de aula:</strong>
	<% @aluno.diasemanas.each do |iDia| %>