app/controllers/alunos_controller.rb

  def index
    #@alunos = Aluno.all
    @alunos_grid = initialize_grid(Aluno.all,:per_page => 1)
---
SELECT "alunos".* FROM "alunos" LIMIT 1 OFFSET 0
SELECT COUNT(*) FROM "alunos"

  def create
    Rails.logger.info("*TREINOS***********************")
    Rails.logger.info( params[:aluno][:treino_1].inspect)
    Rails.logger.info( params[:aluno][:treino_1].inspect)
    Rails.logger.info("***************************************")


    @aluno = Aluno.new(aluno_params)

    respond_to do |format|
      if @aluno.save
---
INSERT INTO "alunos" ("idAcademia", "nascimento", "observacao") VALUES (?, ?, ?)  [["idAcademia", "asd"], ["nascimento", Fri, 06 Sep 2013], ["observacao", "sda"]]

  def destroy
    @aluno.destroy
---
DELETE FROM "alunos" WHERE "alunos"."id" = ?  [["id", 1]]

    def set_aluno
      @aluno = Aluno.find(params[:id])
---
SELECT "alunos".* FROM "alunos" WHERE "alunos"."id" = ? LIMIT 1  [["id", "8"]]