app/controllers/atividades_controller.rb

  def index
    @atividades = Atividade.all
---
SELECT "atividades".* FROM "atividades"

  def create
    @atividade = Atividade.new(atividade_params)

    respond_to do |format|
      if @atividade.save
---
INSERT INTO "atividades" ("created_at", "indicacao", "instrucao", "nome", "observacao", "restricao", "tipo", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

    def set_atividade
      @atividade = Atividade.find(params[:id])
---
SELECT "atividades".* FROM "atividades" WHERE "atividades"."id" = ? LIMIT 1  [["id", "1"]]