app/controllers/diasemanas_controller.rb

SELECT "diasemanas".* FROM "diasemanas"
---
  def index
    @diasemanas = Diasemana.all

INSERT INTO "diasemanas" ("created_at", "nome", "updated_at") VALUES (?, ?, ?)  [["created_at", Thu, 19 Sep 2013 20:50:29 UTC +00:00], ["nome", "domingo"], ["updated_at", Thu, 19 Sep 2013 20:50:29 UTC +00:00]]
---
  def create
    @diasemana = Diasemana.new(diasemana_params)

    respond_to do |format|
      if @diasemana.save

SELECT "diasemanas".* FROM "diasemanas" WHERE "diasemanas"."id" = ? LIMIT 1  [["id", "1"]]
---
    def set_diasemana
      @diasemana = Diasemana.find(params[:id])