app/controllers/exercicios_controller.rb

  def index
    @exercicios = Exercicio.order("nome DESC")
---
SELECT "exercicios".* FROM "exercicios" ORDER BY nome DESC

  def show
    @exercicio = Exercicio.find(params[:id])
---
SELECT "exercicios".* FROM "exercicios" WHERE "exercicios"."id" = ? LIMIT 1  [["id", "1"]]

  def new
    @exercicio = Exercicio.new
    @membro = Membro.all
---
SELECT "membros".* FROM "membros"

  def create
    @exercicio = Exercicio.new(param_exercicio)
    @membro = Membro.all

    respond_to do |format|
      if @exercicio.save
---
INSERT INTO "exercicios" ("created_at", "indicacao", "instrucao", "nome", "restricao", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Tue, 20 Aug 2013 15:15:56 UTC +00:00], ["indicacao", "aa"], ["instrucao", "aa"], ["nome", "aa"], ["restricao", "aa"], ["updated_at", Tue, 20 Aug 2013 15:15:56 UTC +00:00]]

  def destroy
    @exercicio = Exercicio.find(params[:id])
    @exercicio.destroy
---
SELECT "exercicios".* FROM "exercicios" WHERE "exercicios"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "exercicios" WHERE "exercicios"."id" = ?  [["id", 1]]