app/controllers/membros_controller.rb

  def index
    @membros = Membro.all
---
SELECT "membros".* FROM "membros"

  def show
    @membro = Membro.find(params[:id])
---
SELECT "membros".* FROM "membros" WHERE "membros"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @membro = Membro.find(params[:id])
---
SELECT "membros".* FROM "membros" WHERE "membros"."id" = ? LIMIT 1  [["id", "3"]]

  def create
    @membro = Membro.new(membro_params)
    @membro.save
---
INSERT INTO "membros" ("created_at", "nome", "updated_at") VALUES (?, ?, ?)  [["created_at", Mon, 19 Aug 2013 20:31:38 UTC +00:00], ["nome", "Cabeça"], ["updated_at", Mon, 19 Aug 2013 20:31:38 UTC +00:00]]

  def update
    @membro = Membro.find(params[:id])

    respond_to do |format|
      if @membro.update_attributes(params[:membro])
---
SELECT "membros".* FROM "membros" WHERE "membros"."id" = ? LIMIT 1  [["id", "3"]]
UPDATE "membros" SET "nome" = ?, "updated_at" = ? WHERE "membros"."id" = 4  [["nome", "Perna22"], ["updated_at", Tue, 20 Aug 2013 15:01:51 UTC +00:00]]

  def destroy
    @membro = Membros.find(params[:id])
    @membro.destroy
---
SELECT "membros".* FROM "membros" WHERE "membros"."id" = ? LIMIT 1  [["id", "3"]]
DELETE FROM "membros" WHERE "membros"."id" = ?  [["id", 3]]