app/controllers/musculos_controller.rb

  def index
    @musculos = Musculo.all
---
SELECT "musculos".* FROM "musculos"

  def create
    Rails.logger.info("*CAMISAS* CAMISAS***********************")
    Rails.logger.info( params[:musculo][:atividade_ids].inspect)
    Rails.logger.info("***************************************")

    @musculo = Musculo.new(musculo_params)

    respond_to do |format|
      if @musculo.save
---
INSERT INTO "musculos" ("created_at", "nome", "observacao", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Wed, 04 Sep 2013 15:04:23 UTC +00:00], ["nome", "11"], ["observacao", "23"], ["updated_at", Wed, 04 Sep 2013 15:04:23 UTC +00:00]]

  def destroy
    @musculo.destroy
---
DELETE FROM "musculos" WHERE "musculos"."id" = ?  [["id", 6]]

    def set_musculo
      @musculo = Musculo.find(params[:id])
---
SELECT "musculos".* FROM "musculos" WHERE "musculos"."id" = ? LIMIT 1  [["id", "6"]]