app/controllers/treinos_controller.rb

SELECT "alunos".* FROM "alunos" WHERE "alunos"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "musculos".* FROM "musculos"
SELECT "atividades".* FROM "atividades" WHERE "atividades"."tipo" = 'A'
SELECT "diasemanas".* FROM "diasemanas" INNER JOIN "alunoaulas" ON "diasemanas"."id" = "alunoaulas"."diasemana_id" WHERE "alunoaulas"."aluno_id" = ?  [["aluno_id", 1]]
---
  def new
    @treino = Treino.new
    @treino.aluno_id = params[:aluno]
    @treino.adaptacaos.build

    aluno = Aluno.find(params[:aluno])

    Musculo.all.each do |m|
      @treino.ordemmusculotreinos.build(:musculo_id => m.id )
    end

    Atividade.where(tipo: 'A').each do |aa|
      #@treino.atividadetreinos
      atTreino = @treino.atividadetreinos.build(:atividade_id => aa.id)
      aluno.diasemanas.each do |diaSem|

INSERT INTO "treinos" ("aluno_id", "created_at", "criacao", "observacao", "updated_at", "validade") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @treino = Treino.new(treino_params)
    @treino.aluno_id = params[:alunoId]

    Rails.logger.info("*MUSCULO*ORDEMS**********************")
    Rails.logger.info( params[:treino][:musculo_ids].inspect)
    Rails.logger.info("***************************************")


    respond_to do |format|
      if @treino.save

SELECT "treinos".* FROM "treinos" WHERE "treinos"."id" = ? LIMIT 1  [["id", "17"]]
---
  def set_treino
    @treino = Treino.find(params[:id])