app/controllers/treinos_controller.rb

SELECT "atividades".* FROM "atividades" INNER JOIN "atividadetreinos" ON "atividades"."id" = "atividadetreinos"."atividade_id" WHERE "atividadetreinos"."treino_id" = ?  [["treino_id", 1]]
---
  def update
     # params[:treino][:ordemmusculotreinos_attributes].each do |relacionamento|
     #  r =  relacionamento[1][:musculo_attributes][:atividades_attributes]
     #
    if not params[:treino][:atividade_ids].present?
      params[:treino][:atividade_ids] = []
    end
    #Tratamento  para evitar o erro na atualizacao do treinos.
    #Estva excluindo as atividades do treino Muscular.
    @result =  Atividadetreino.joins('JOIN atividades on atividadetreinos.atividade_id = atividades.id').where('atividades.tipo' => 'A')